# Learning Pandas

## Pandas Series
---
- A Series is a one-Dimensional labeled array capable of holding any data type.The axis are collectively called the index.

### Creating Series
- There are multiple ways to create a pandas series

In [9]:
import pandas as pd
import numpy as np
labels = ["A","B","C","D","E"]

lst = [10,20,30,40,50]
arr = np.array(lst)
dic = {
    "A" : 10,
    "B" : 20,
    "C" : 30,
    "D" : 40,
    "E" : 50
}


data1 = pd.Series(lst,index=labels)
data2 = pd.Series(arr,index=labels)
data3 = pd.Series(dic)
print(data1,"\n",data2,"\n",data3)

A    10
B    20
C    30
D    40
E    50
dtype: int64
 A    10
B    20
C    30
D    40
E    50
dtype: int64
 A    10
B    20
C    30
D    40
E    50
dtype: int64

## Dataframe
---
- When to combine mutliple series into one table then dataframe is created.

In [13]:
import numpy as np
import pandas as pd

# list/array/dict

data = {
    "Name": ["John","Anna","Peter","Linda"],
    "Age" : [26,43,56,23],
    "City" : ["Delhi","Noida","Kanpur","Agra"],
    "Salary" : [65000,56000,34000,66000]
}

# values are header
# values are data 

df = pd.DataFrame(data)
print(df)

    Name  Age    City  Salary
0   John   26   Delhi   65000
1   Anna   43   Noida   56000
2  Peter   56  Kanpur   34000
3  Linda   23    Agra   66000

In [41]:
# Using List to create dataframe
colm = ["Name","Age","City","Salary"]
data_list = [
    ["John",36,"Delhi",56000],
    ["Anna",34,"Noida",45000],
    ["Peter",20,"Kanpur",78000],
    ["Linda",65,"Agra",67000]
]

df = pd.DataFrame(data_list,columns=colm)
df

    Name  Age    City  Salary
0   John   36   Delhi   56000
1   Anna   34   Noida   45000
2  Peter   20  Kanpur   78000
3  Linda   65    Agra   67000

### Selection and Indexing of Columns
---

In [34]:
for name,value in df.items():
    print(name,"\n",value)

Name
 0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object
Age
 0    36
1    34
2    20
3    65
Name: Age, dtype: int64
City
 0     Delhi
1     Noida
2    Kanpur
3      Agra
Name: City, dtype: object
Salary
 0    56000
1    45000
2    78000
3    67000
Name: Salary, dtype: int64

In [40]:
df[["Name","City"]]

    Name    City
0   John   Delhi
1   Anna   Noida
2  Peter  Kanpur
3  Linda    Agra

### Append New Column into DF
---

In [58]:
df["Designation"] = ["Dr.","Eng.","ME","EE"]
df

    Name  Age    City  Salary Designation
0   John   36   Delhi   56000         Dr.
1   Anna   34   Noida   45000        Eng.
2  Peter   20  Kanpur   78000          ME
3  Linda   65    Agra   67000          EE

### Remove Column from Dataframe
---

In [ ]:
df.drop("Designation",axis=1)  ## It delete the Column Temp.

    Name  Age    City  Salary
0   John   36   Delhi   56000
1   Anna   34   Noida   45000
2  Peter   20  Kanpur   78000
3  Linda   65    Agra   67000

In [ ]:
df.drop("Designation",axis=1,inplace=True)  ## Delete the Column Permanet
## To delete a row "axis = 0"
df

    Name  Age    City  Salary
0   John   36   Delhi   56000
1   Anna   34   Noida   45000
2  Peter   20  Kanpur   78000
3  Linda   65    Agra   67000

### Selecting Row
---

In [69]:
df["Age"][0]

np.int64(36)

### Selecting Subset of Rows and Column
---

In [79]:
df.loc[2:][["Name","Age"]]

    Name  Age
2  Peter   20
3  Linda   65

### Conditional Selection
---

In [86]:
## Show People those age is 30 and more
df[df["Age"] >= 30]

    Name  Age   City  Salary
0   John   36  Delhi   56000
1   Anna   34  Noida   45000
3  Linda   65   Agra   67000

In [92]:
## Show People age is greater then 30 and city is Noida
df[(df["Age"] > 30) & (df["City"] == "Noida")]

   Name  Age   City  Salary
1  Anna   34  Noida   45000

## Missing Data

In [9]:
import numpy as np
import pandas as pd

data = {
    'A' : [1,2,np.nan,4,5],
    'B' : [np.nan,2,3,4,5],
    'C' : [1,2,3,np.nan,np.nan],
    'D' : [1,np.nan,np.nan,np.nan,5],
}

df = pd.DataFrame(data)
df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

In [ ]:
df.isna()   ## Find NaN

       A      B      C      D
0  False   True  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [ ]:
df.isna().sum()  ## Count NaN in each Column

A    1
B    1
C    2
D    3
dtype: int64

In [ ]:
df.isna().any()  ## Check NaN is Column

A    True
B    True
C    True
D    True
dtype: bool

In [ ]:
df.dropna()   ## It works on Rows if NaN is Present it remove that row

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [ ]:
df.dropna(thresh=3)   # Drops rows that have **less than 3 non-NaN (non-null) values**

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
4  5.0  5.0  NaN  5.0

In [ ]:
## Filling the missing Data

# 1. fill all the NaN values with Zero(0)
df.fillna(0)   ## It is temp. for permat. use inplace = True

     A    B    C    D
0  1.0  0.0  1.0  1.0
1  2.0  2.0  2.0  0.0
2  0.0  3.0  3.0  0.0
3  4.0  4.0  0.0  0.0
4  5.0  5.0  0.0  5.0

In [ ]:
# 2. Fill with different Values for each Column.
missing_values = {
    'A' : 0,
    'B' : 100,
    'C' : 200,
    'D' : 300
}

df.fillna(missing_values)

     A      B      C      D
0  1.0  100.0    1.0    1.0
1  2.0    2.0    2.0  300.0
2  0.0    3.0    3.0  300.0
3  4.0    4.0  200.0  300.0
4  5.0    5.0  200.0    5.0

In [12]:
# 3. Fill the missing values with mean
df.fillna(df.mean())

     A    B    C    D
0  1.0  3.5  1.0  1.0
1  2.0  2.0  2.0  3.0
2  3.0  3.0  3.0  3.0
3  4.0  4.0  2.0  3.0
4  5.0  5.0  2.0  5.0

# Merging,Joining & Concatination

### 1. Merging
---

In [25]:
import numpy as np
import pandas as pd

emp = pd.DataFrame({
    'emp_id' : [1,2,3,4,5],
    'name' : ["John","Anna","Peter","Linda","Bob"],
    'department' : ['HR','IT','Finance','IT','HR']
})

sal = pd.DataFrame({
    'emp_id' : [1,2,3,6,7],
    'salary' : [60000,80000,65000,70000,90000],
    'bonus' : [5000,10000,7000,8000,12000]
})

In [ ]:
pd.merge(emp,sal)  # Equivalent to SQL: SELECT * FROM emp INNER JOIN sal ON common_column  
# how = 'inner' Default Mean intersection

   emp_id   name department  salary  bonus
0       1   John         HR   60000   5000
1       2   Anna         IT   80000  10000
2       3  Peter    Finance   65000   7000

In [ ]:
pd.merge(emp,sal,how='outer')   # Full Outter Join Mean Union

   emp_id   name department   salary    bonus
0       1   John         HR  60000.0   5000.0
1       2   Anna         IT  80000.0  10000.0
2       3  Peter    Finance  65000.0   7000.0
3       4  Linda         IT      NaN      NaN
4       5    Bob         HR      NaN      NaN
5       6    NaN        NaN  70000.0   8000.0
6       7    NaN        NaN  90000.0  12000.0

In [ ]:
pd.merge(emp,sal,how='left')

   emp_id   name department   salary    bonus
0       1   John         HR  60000.0   5000.0
1       2   Anna         IT  80000.0  10000.0
2       3  Peter    Finance  65000.0   7000.0
3       4  Linda         IT      NaN      NaN
4       5    Bob         HR      NaN      NaN

In [29]:
pd.merge(emp,sal,how='right')

   emp_id   name department  salary  bonus
0       1   John         HR   60000   5000
1       2   Anna         IT   80000  10000
2       3  Peter    Finance   65000   7000
3       6    NaN        NaN   70000   8000
4       7    NaN        NaN   90000  12000

### Concatination
---

In [31]:
df1 = pd.DataFrame({
    'A' : ['A0','A1','A2'],
    'B' : ['B0','B1','B2'],
    'C' : ['C0','C1','C2']
})

df2 = pd.DataFrame({
    'A' : ['A3','A4','A5'],
    'B' : ['B3','B4','B5'],
    'C' : ['C3','C4','C5']
})

In [ ]:
pd.concat([df1,df2])  # default axios = 0  column wise

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [ ]:
pd.concat([df1,df2],axis=1)   # axios = 1 row wise

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

## Joining
---

In [37]:
df1 = pd.DataFrame({
    'name' : ['Alice','Bob','Charlie']
},index=[1,2,3])

df2 = pd.DataFrame({
    'score' : [85,90,75]    
},index=[2,3,4])

In [38]:
df1.join(df2)

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0